Update lecture_01_distributed_storage_batch.md
